#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/micropay/gh-actions/runs/run-6JaptQzHrExzJK1X

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.tf_next.module.statics_deploy.aws_s3_bucket.static_deploy: Refreshing state... [id=tf-nextjs-micropay-web-tfn-static20220104052826240900000004]
module.tf_next.module.statics_deploy.aws_s3_bucket.static_upload: Refreshing state... [id=tf-nextjs-micropay-web-tfn-deploy20220104052826355900000006]
module.tf_next.module.next_image[0].module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=11onayrqk5]
module.tf_next.aws_cloudfront_cache_policy.this: Refreshing state... [id=03c510fc-451e-45ab-a107-ab84ec34c7af]
module.tf_next.module.proxy_config.aws_s3_bucket.proxy_config_store: Refreshing state... [id=tf-nextjs-micropay-web-tfn-config20220104052825412400000001]
module.tf_next.module.next_image[0].module.image_optimizer.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tf-nextjs-micropay-web_tfn-image]
module.tf_next.module.statics_deploy.aws_sns_topic.this: Refreshing state... [id=arn:aws:sns:us-west-2:213662483306:tf-nextjs-micropay-web20220104052826386200000008]
module.tf_next.aws_cloudwatch_log_group.this["__NEXT_API_LAMBDA_0"]: Refreshing state... [id=/aws/lambda/tf-nextjs-micropay-web___NEXT_API_LAMBDA_0]
module.tf_next.module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=o95zp4j33d]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tf-nextjs-micropay-web_tfn-deploy]
module.tf_next.module.statics_deploy.aws_sqs_queue.this: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/213662483306/tf-nextjs-micropay-web20220104052825624700000003]
module.tf_next.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::213662483306:policy/terraform-20220104052826249600000005]
module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_role.lambda[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-image]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_role.lambda[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-deploy]
module.cloudfront_cert.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:213662483306:certificate/22849ad3-844b-4094-a555-b3d29c66e806]
module.tf_next.module.proxy.module.edge_proxy.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/us-east-1.tf-nextjs-micropay-web_tfn-proxy]
module.tf_next.module.next_image[0].module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.tf_next.aws_iam_role.lambda["__NEXT_API_LAMBDA_0"]: Refreshing state... [id=tf-nextjs-micropay-web___NEXT_API_LAMBDA_0]
module.tf_next.module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.tf_next.aws_lambda_permission.current_version_triggers["__NEXT_API_LAMBDA_0"]: Refreshing state... [id=AllowInvokeFromApiGateway]
module.tf_next.module.proxy.module.edge_proxy.aws_iam_role.lambda[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-proxy]
module.tf_next.module.statics_deploy.aws_sns_topic_subscription.this: Refreshing state... [id=arn:aws:sns:us-west-2:213662483306:tf-nextjs-micropay-web20220104052826386200000008:2a1e87bd-bb11-4380-8869-60ae0c7cdb31]
module.cloudfront_cert.aws_route53_record.validation[0]: Refreshing state... [id=Z0654085V5EAR601WU0T__3a1501977e5670168cfbf58d835dda06.micropay.gg._CNAME]
module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::213662483306:policy/tf-nextjs-micropay-web_tfn-image-logs]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::213662483306:policy/tf-nextjs-micropay-web_tfn-deploy-logs]
module.tf_next.module.proxy.module.edge_proxy.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::213662483306:policy/tf-nextjs-micropay-web_tfn-proxy-logs]
module.tf_next.aws_iam_role_policy_attachment.lambda_logs["__NEXT_API_LAMBDA_0"]: Refreshing state... [id=tf-nextjs-micropay-web___NEXT_API_LAMBDA_0-20220104052827304300000009]
module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-image-2022010405282788760000000a]
module.tf_next.aws_lambda_function.this["__NEXT_API_LAMBDA_0"]: Refreshing state... [id=tf-nextjs-micropay-web___NEXT_API_LAMBDA_0]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-deploy-logs]
module.cloudfront_cert.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2022-01-04 05:28:44.925 +0000 UTC]
module.tf_next.module.proxy.module.edge_proxy.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-proxy-logs]
module.tf_next.module.proxy.module.edge_proxy.aws_lambda_function.this[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-proxy]
module.tf_next.module.api_gateway.aws_apigatewayv2_integration.this["ANY /__NEXT_API_LAMBDA_0/{proxy+}"]: Refreshing state... [id=8xckvkj]
module.tf_next.module.api_gateway.aws_apigatewayv2_route.this["ANY /__NEXT_API_LAMBDA_0/{proxy+}"]: Refreshing state... [id=mb6z5f8]
module.tf_next.module.proxy_config.aws_cloudfront_origin_access_identity.this: Refreshing state... [id=E33J0NDMQF4126]
module.tf_next.module.proxy_config.aws_s3_bucket_object.config_json: Refreshing state... [id=proxy-config.json]
module.tf_next.module.next_image[0].aws_cloudfront_cache_policy.this: Refreshing state... [id=4bd88fac-57e6-4aab-9e07-1d913c93beaf]
module.tf_next.module.next_image[0].aws_cloudfront_origin_request_policy.this: Refreshing state... [id=b49ad859-a556-4cb3-8125-234cd7791e44]
module.tf_next.module.next_image[0].module.image_optimizer.aws_lambda_function.this[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-image]
module.tf_next.module.statics_deploy.aws_cloudfront_origin_access_identity.this: Refreshing state... [id=E1XZ6N3L1GKI4I]
module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::213662483306:policy/tf-nextjs-micropay-web_tfn-image]
module.tf_next.module.proxy_config.aws_cloudfront_distribution.distribution: Refreshing state... [id=E4B4I49WHO5JR]
module.tf_next.module.proxy_config.aws_s3_bucket_policy.proxy_config_store_origin_access: Refreshing state... [id=tf-nextjs-micropay-web-tfn-config20220104052825412400000001]
module.tf_next.module.statics_deploy.aws_s3_bucket_policy.origin_access: Refreshing state... [id=tf-nextjs-micropay-web-tfn-static20220104052826240900000004]
module.tf_next.module.next_image[0].module.image_optimizer.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-image-2022010405283165800000000e]
aws_cloudfront_distribution.distribution: Refreshing state... [id=E1MK4HMLCZBB68]
aws_route53_record.cloudfront_alias_domain: Refreshing state... [id=Z0654085V5EAR601WU0T_micropay.gg_A]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_function.this[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-deploy]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy.additional_jsons[0]: Refreshing state... [id=arn:aws:iam::213662483306:policy/tf-nextjs-micropay-web_tfn-deploy-0]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy.additional_jsons[2]: Refreshing state... [id=arn:aws:iam::213662483306:policy/tf-nextjs-micropay-web_tfn-deploy-2]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy.additional_jsons[1]: Refreshing state... [id=arn:aws:iam::213662483306:policy/tf-nextjs-micropay-web_tfn-deploy-1]
module.tf_next.module.next_image[0].module.image_optimizer.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"]: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.tf_next.module.next_image[0].module.api_gateway.aws_apigatewayv2_integration.this["GET /_next/{proxy+}"]: Refreshing state... [id=epiu3jd]
module.tf_next.module.next_image[0].module.image_optimizer.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy_attachment.additional_jsons[2]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-deploy-2]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy_attachment.additional_jsons[1]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-deploy-1]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_iam_policy_attachment.additional_jsons[0]: Refreshing state... [id=tf-nextjs-micropay-web_tfn-deploy-0]
module.tf_next.module.next_image[0].module.api_gateway.aws_apigatewayv2_route.this["GET /_next/{proxy+}"]: Refreshing state... [id=01ehs0o]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromS3Bucket"]: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.tf_next.module.statics_deploy.aws_s3_bucket_notification.on_create: Refreshing state... [id=tf-nextjs-micropay-web-tfn-deploy20220104052826355900000006]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_event_source_mapping.this["sqs_source"]: Refreshing state... [id=3a7c0c5e-2bb6-4d92-ba28-4bc8a85565e2]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.unqualified_alias_triggers["InvalidationQueue"]: Refreshing state... [id=InvalidationQueue]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.current_version_triggers["InvalidationQueue"]: Refreshing state... [id=InvalidationQueue]
module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.current_version_triggers["AllowExecutionFromS3Bucket"]: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.tf_next.module.statics_deploy.aws_sqs_queue_policy.this: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/213662483306/tf-nextjs-micropay-web20220104052825624700000003]
module.tf_next.module.statics_deploy.null_resource.static_s3_upload[0]: Refreshing state... [id=4060036635276972663]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.tf_next.module.proxy_config.aws_cloudfront_origin_access_identity.this has changed
  ~ resource "aws_cloudfront_origin_access_identity" "this" {
      ~ etag                            = "E1FPTEHV1LF93N" -> "E3DDS6THVH4F1V"
        id                              = "E33J0NDMQF4126"
        # (5 unchanged attributes hidden)
    }

  # module.tf_next.module.statics_deploy.aws_cloudfront_origin_access_identity.this has changed
  ~ resource "aws_cloudfront_origin_access_identity" "this" {
      ~ etag                            = "E34KCJVLBH8L9I" -> "E1U1AQ0J5GPHSK"
        id                              = "E1XZ6N3L1GKI4I"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_distribution.distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "distribution" {
        id                             = "E1MK4HMLCZBB68"
        tags                           = {}
        # (19 unchanged attributes hidden)


      ~ default_cache_behavior {
            # (13 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:213662483306:function:tf-nextjs-micropay-web_tfn-proxy:1" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }




        # (7 unchanged blocks hidden)
    }

  # module.tf_next.aws_cloudfront_cache_policy.this will be updated in-place
  ~ resource "aws_cloudfront_cache_policy" "this" {
      ~ default_ttl = 86400 -> 0
        id          = "03c510fc-451e-45ab-a107-ab84ec34c7af"
        name        = "tf-nextjs-micropay-web_tfn-cache"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tf_next.aws_lambda_function.this["__NEXT_API_LAMBDA_0"] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "tf-nextjs-micropay-web___NEXT_API_LAMBDA_0"
      ~ last_modified                  = "2022-01-11T02:01:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "d7khhDdUGzGtBSPSWVbOFksKf3BGzkMn0y4S4R04A3Y=" -> "i63kI9o8sGQkbgmso/kV16+NgNo00yyLqkcIoboOiIA="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.tf_next.module.statics_deploy.null_resource.static_s3_upload[0] must be replaced
-/+ resource "null_resource" "static_s3_upload" {
      ~ id       = "4060036635276972663" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "static_files_archive" = "53d33274c23cff1788ae41d167a7426c" -> "d4b54f84506e8d436217b4a8f56cc02f"
        }
    }

  # module.tf_next.module.proxy.module.edge_proxy.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "tf-nextjs-micropay-web_tfn-proxy"
      ~ last_modified                  = "2022-01-04T05:28:34.628+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:213662483306:function:tf-nextjs-micropay-web_tfn-proxy:1" -> (known after apply)
      ~ source_code_hash               = "82jtpw8BXUKtAHxbNx9/CyDpixRsPcUEkK2F5iVQM0k=" -> "bevK3WZiZwpFbwOZRLb3l84nC3gVDH0Xf0P9Cqy6rPI="
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "tf-nextjs-micropay-web_tfn-deploy"
      ~ last_modified                  = "2022-01-04T05:34:53.571+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:213662483306:function:tf-nextjs-micropay-web_tfn-deploy:1" -> (known after apply)
      ~ source_code_hash               = "36/6dUSR0IiQDugzwtIlpN47qg+pGrkkjHYZ/Aakn5I=" -> "jFp3JKBsaSKVbLObwP1w0qTTPNvI5olmc/HtBUFG8Wo="
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.current_version_triggers["AllowExecutionFromS3Bucket"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "AllowExecutionFromS3Bucket" -> (known after apply)
      ~ qualifier     = "1" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.tf_next.module.statics_deploy.module.deploy_trigger.aws_lambda_permission.current_version_triggers["InvalidationQueue"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "InvalidationQueue" -> (known after apply)
      ~ qualifier     = "1" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 3 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "TF_VAR_jwt_secret" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @notjustinshaw, Action: `pull_request`*